[{
  "name": "barbarian",
  "description": "For some, there is only rage. In the ways of their people, in the fury of their passion, in the howl of battle, conflict is all these brutal souls know. Savages, hired muscle, masters of vicious martial techniques, they are not soldiers or professional warriors—they are the battle possessed, creatures of slaughter and spirits of war. Known as barbarians, these warmongers know little of training, preparation, or the rules of warfare; for them, only the moment exists, with the foes that stand before them and the knowledge that the next moment might hold their death. They possess a sixth sense in regard to danger and the endurance to weather all that might entail. These brutal warriors might rise from all walks of life, both civilized and savage, though whole societies embracing such philosophies roam the wild places of the world. Within barbarians storms the primal spirit of battle, and woe to those who face their rage.",
  "base_attack_rate": "fast",
  "fort_save": "strong",
  "ref_save": "weak",
  "will_save": "weak",
  "skill_ranks_per_level": 4,
  "hd": 12,
  "class_skills": [
    "acrobatics",
    "climb",
    "craft",
    "handle animal",
    "intimidate",
    "knowledge",
    "perception",
    "ride",
    "survival",
    "swim"
  ]
},{
  "name": "druid",
  "description": "Within the purity of the elements and the order of the wilds lingers a power beyond the marvels of civilization. Furtive yet undeniable, these primal magics are guarded over by servants of philosophical balance known as druids. Allies to beasts and manipulators of nature, these often misunderstood protectors of the wild strive to shield their lands from all who would threaten them and prove the might of the wilds to those who lock themselves behind city walls. Rewarded for their devotion with incredible powers, druids gain unparalleled shape-shifting abilities, the companionship of mighty beasts, and the power to call upon nature's wrath. The mightiest temper powers akin to storms, earthquakes, and volcanoes with primeval wisdom long abandoned and forgotten by civilization.",
  "bonus_spells_per_day": true,
  "casting_stat": "wis",
  "spells_per_day_rate": "wide",
  "base_attack_rate": "average",
  "fort_save": "strong",
  "ref_save": "weak",
  "will_save": "strong",
  "skill_ranks_per_level": 4,
  "hd": 8,
  "class_skills": [
    "climb",
    "craft",
    "fly",
    "handle animal",
    "heal",
    "knowledge (geography)",
    "knowledge (nature)",
    "perception",
    "profession",
    "ride",
    "spellcraft",
    "survival",
    "swim"
  ]
},{
  "name": "ranger",
  "description": "For those who relish the thrill of the hunt, there are only predators and prey. Be they scouts, trackers, or bounty hunters, rangers share much in common: unique mastery of specialized weapons, skill at stalking even the most elusive game, and the expertise to defeat a wide range of quarries. Knowledgeable, patient, and skilled hunters, these rangers hound man, beast, and monster alike, gaining insight into the way of the predator, skill in varied environments, and ever more lethal martial prowess. While some track man-eating creatures to protect the frontier, others pursue more cunning game—even fugitives among their own people.",
  "bonus_spells_per_day": true,
  "casting_stat": "wis",
  "spells_per_day_rate": "late",
  "base_attack_rate": "fast",
  "fort_save": "strong",
  "ref_save": "strong",
  "will_save": "weak",
  "skill_ranks_per_level": 6,
  "hd": 10,
  "class_skills": [
    "climb",
    "craft",
    "handle animal",
    "heal",
    "intimidate",
    "knowledge (dungeoneering)",
    "knowledge (geography)",
    "knowledge (nature)",
    "perception",
    "profession",
    "ride",
    "spellcraft",
    "stealth",
    "survival",
    "swim"
  ]
},{
  "name": "wizard",
  "description": "Beyond the veil of the mundane hide the secrets of absolute power. The works of beings beyond mortals, the legends of realms where gods and spirits tread, the lore of creations both wondrous and terrible—such mysteries call to those with the ambition and the intellect to rise above the common folk to grasp true might. Such is the path of the wizard. These shrewd magic-users seek, collect, and covet esoteric knowledge, drawing on cultic arts to work wonders beyond the abilities of mere mortals. While some might choose a particular field of magical study and become masters of such powers, others embrace versatility, reveling in the unbounded wonders of all magic. In either case, wizards prove a cunning and potent lot, capable of smiting their foes, empowering their allies, and shaping the world to their every desire.",
  "bonus_spells_per_day": true,
  "casting_stat": "int",
  "spells_per_day_rate": "wide",
  "base_attack_rate": "slow",
  "fort_save": "weak",
  "ref_save": "weak",
  "will_save": "strong",
  "skill_ranks_per_level": 2,
  "hd": 6,
  "class_skills": [
    "appraise",
    "craft",
    "fly",
    "knowledge",
    "linguistics",
    "profession",
    "spellcraft"
  ]
}]
